ERP DEV.КонтурМаркировка/src/DataProcessors/КонтурМаркировка/КонтурМаркировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтурМаркировка</name>
  <comment>KonturMark.epf</comment>
</mdclass:DataProcessor>

ERP DEV.КонтурМаркировка/src/Catalogs/КонтурМаркировка_Организации/КонтурМаркировка_Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурМаркировка_Организации</name>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <comment>Идентификатор организации в сервисе Контур.Маркировка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтпечатокСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючОрганизации1С</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлючаОрганизации1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.КонтурМаркировка/src/DataProcessors/КонтурМаркировка/Forms/Форма_Организация/Module.bsl
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Ссылка = Параметры.Ссылка;
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверитьВыполнениеОбменаССервисом();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	МодульКлиента().СохранитьИзмененияНаФорме("ЗаписатьИЗакрыть", ЭтаФорма, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурМаркировка_ЗапущенОбменССервисом" Тогда
		Если Параметр.Организация = Ссылка Тогда
			ОбновитьСтатусОбменаССервисом();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Очистить();
	ПроверяемыеРеквизиты.Добавить("ИНН");
	ПроверяемыеРеквизиты.Добавить("Организация1С");
	ПроверяемыеРеквизиты.Добавить("Наименование");
	
	Если Не МодульОбъекта().ЭтоИП(ИНН) Тогда
		ПроверяемыеРеквизиты.Добавить("КПП");
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура Организация1СПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Организация1С) Тогда
		ЗаполнитьРеквизитыОрганизации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторПриИзменении(Элемент)
	
	ВыполненаНастройка = ЗначениеЗаполнено(Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	ИНН = СокрЛП(ИНН);
	
КонецПроцедуры

&НаКлиенте
Процедура КПППриИзменении(Элемент)
	
	КПП = СокрЛП(КПП);
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьОбменПриИзменении(Элемент)
	
	НастроитьЭлементыФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьЧтениеВходящихУПДПриИзменении(Элемент)
	
	НастроитьЭлементыФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ГраницаЧтенияЛентыПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		МодульКлиента().СообщитьПользователюЛок(НСтр("ru = 'Необходимо записать организацию'"), УникальныйИдентификатор);
		Возврат;
	КонецЕсли;
	
	ЗаписатьГраницуЧтенияЛенты();
	
	НастроитьЭлементыФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаСброситьГраницуЧтенияЛентыНаОшибкуНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		МодульКлиента().СообщитьПользователюЛок(НСтр("ru = 'Необходимо записать организацию'"), УникальныйИдентификатор);
		Возврат;
	КонецЕсли;
	
	СброситьГраницуЧтенияЛенты();
	
	НастроитьЭлементыФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНастройкиОрганизацииНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьСтраницуНастроекОрганизации(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаТарифНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	МодульКлиента().ОткрытьСтраницуТарифовОрганизации(Ссылка);
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеПолей() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИдентификаторИзСервиса(Команда)
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность
		И Не ПроверитьЗаполнениеПолей() Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	НовыйИдентификатор = МодульКлиента().Организация_ИдентификаторИзСервиса(Ссылка, ЭтаФорма);
	ВыполненаНастройка = (НовыйИдентификатор <> Идентификатор);
	Идентификатор = НовыйИдентификатор;
	
	Модифицированность = ВыполненаНастройка;
	
	ОбновитьИнформациюОТарифах();
	
	НастроитьЭлементыФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИдентификаторGS1ИзСервиса(Команда)
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность
		И Не ПроверитьЗаполнениеПолей() Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	НовыйИдентификаторGS1 = МодульКлиента().Организация_ИдентификаторGS1ИзСервиса(Ссылка, ЭтаФорма);
	Модифицированность = (НовыйИдентификаторGS1 <> ИдентификаторGS1);
	ИдентификаторGS1 = НовыйИдентификаторGS1;
	
	НастроитьЭлементыФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменССервисом(Команда)
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность
		И Не ПроверитьЗаполнениеПолей() Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	Если МодульКлиента().ОчередьОбмена_ЕстьФайлыДляПодписи(Ссылка) Тогда
		МодульКлиента().ОткрытьФормуПодписанияИОтправки(ЭтаФорма, Ссылка);
	Иначе
		МодульКлиента().ЗапуститьОбменПоОрганизации(ЭтаФорма, Ссылка);
		ОбновитьСтатусОбменаССервисом();
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ПроверкаЗаполнения

&НаКлиенте
Функция ПроверитьЗаполнениеПолей()
	
	ОчиститьСообщения();
	
	Возврат ПроверитьЗаполнениеПолейНаСервере();
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеПолейНаСервере()
	
	ЕстьОшибки = Не ПроверитьЗаполнение();
	
	ПроверитьОрганизацию1С(ЕстьОшибки);
	ПроверитьИдентификаторGS1(ЕстьОшибки);
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

&НаСервере
Процедура ПроверитьОрганизацию1С(ЕстьОшибки)
	
	Если Не ЗначениеЗаполнено(Организация1С) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурМаркировка_Организации КАК Т
	|ГДЕ
	|	Т.Ссылка <> &Ссылка
	|	И Т.КлючОрганизации1С = &КлючОрганизации1С
	|	И Т.ТипКлючаОрганизации1С = &ТипКлючаОрганизации1С");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("КлючОрганизации1С", МодульОбъекта().КлючОбъекта1С(Организация1С));
	Запрос.УстановитьПараметр("ТипКлючаОрганизации1С", МодульОбъекта().ТипКлючаОбъекта1С(Организация1С));
	
	ДругаяОрганизация = МодульОбъекта().ПолучитьРезультатЗапроса(Запрос);
	
	Если ЗначениеЗаполнено(ДругаяОрганизация) Тогда
		ТекстСообщения = НСтр("ru = 'Организация 1С ""%1"" уже использована в ""%2""'");
		ТекстСообщения = МодульОбъекта().ПараметрыВСтроку(ТекстСообщения, Организация1С, ДругаяОрганизация);
		МодульОбъекта().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор, "Организация1С");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИдентификаторGS1(ЕстьОшибки)
	
	Если Не МодульОбъекта().ВСтрокеТолькоЦифры(ИдентификаторGS1) Тогда
		ТекстОшибки = НСтр("ru = 'Идентификатор в GS1 должен содержать только цифры'");
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор, "ИдентификаторGS1");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьФорму()
	
	ОбновитьИнформациюОТарифах();
	ЗаполнитьКонтекстФормы();
	НастроитьТипыЭлементовФормы();
	НастроитьЭлементыФормы(ЭтаФорма);
	НастроитьОтображениеСрокаТарифа();
	ПоказатьУведомлениеЗаполнитеАнкету();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтекстФормы()
	
	ДопСвойства = МодульОбъекта().Перечисление_ДопСвойства();
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Организация = МодульОбъекта().Организация_Прочитать(Ссылка);
	Иначе
		Организация = МодульОбъекта().Новый_Организация();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Организация);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Организация.ДопРеквизиты);
	
	РазрешитьОбмен = Не Организация.ДопРеквизиты.ОтключитьОбмен;
	РазрешитьЧтениеВходящихУПД = Не Организация.ДопРеквизиты.ОтключитьЧтениеВходящихУПД;
	РазрешитьЧтениеУведомленийОПриемке = Не Организация.ДопРеквизиты.ОтключитьЧтениеУведомленийОПриемке;
	
	ДатаПоследнегоОбмена = МодульОбъекта().ДопСвойство_Прочитать(Ссылка
	, ДопСвойства.ДатаПоследнегоОбмена);
	
	ГраницаЧтенияЛенты = МодульОбъекта().ГраницаЧтенияЛенты(Ссылка);
	ГраницаОшибкиЧтенияЛенты = МодульОбъекта().ГраницаОшибкиЧтенияЛенты(Ссылка);
	ИдентификаторСобытияОшибкиЛенты = МодульОбъекта().ИдентификаторСобытияОшибкиЛенты(Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьТипыЭлементовФормы()
	
	ТипОрганизции = МодульОбъекта().ТипыОбъектовИС().Организация;
	МодульОбъекта().УстановитьОграничениеПоТипу(Элементы.Организация1С, ТипОрганизции);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьЭлементыФормы(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ГруппаОшибкаЧтенияЛенты.Видимость = ЗначениеЗаполнено(Форма.ИдентификаторСобытияОшибкиЛенты);
	
	Элементы.ГруппаЛентаСобытий.Доступность = Форма.РазрешитьОбмен;
	
	ИдентификаторЗаполнен = ЗначениеЗаполнено(Форма.Идентификатор);
	Элементы.СсылкаНастройкиОрганизации.Доступность = ИдентификаторЗаполнен;
	Элементы.ГруппаИнформацияОТарифе.Видимость = ИдентификаторЗаполнен;
	
	Если ТипЗнч(Форма.ГраницаЧтенияЛенты) = Тип("Дата") Тогда
		Элементы.ГраницаЧтенияЛенты.Заголовок = "Граница чтения ленты (UTC)";
	Иначе
		Элементы.ГраницаЧтенияЛенты.Заголовок = "Граница чтения ленты";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать()
	
	ЗаписатьНаСервере();
	
	Оповестить("КонтурМаркировка_Организация_Изменен", Ссылка);
	
	ОповеститьОбИзменении(Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ОписаниеОрганизации = ОписаниеОрганизацииПоКонтекстуФормы();
	
	Ссылка = МодульОбъекта().Организация_Записать(ОписаниеОрганизации);
	
	Действие = МодульОбъекта().Перечисление_ДействияМетрики().ЗаписьВБазу;
	МодульОбъекта().Метрика_ОписаниеОрганизации(Действие, Ссылка);
	
	Если ВыполненаНастройка Тогда
		МодульОбъекта().МетрикаОП_ЦелевоеДействие_НастройкаОрганизации(Ссылка);
		ВыполненаНастройка = Ложь;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьГраницуЧтенияЛенты()
	
	МодульОбъекта().ГраницаЧтенияЛенты_Записать(Ссылка, ГраницаЧтенияЛенты);
	
КонецПроцедуры

&НаСервере
Процедура СброситьГраницуЧтенияЛенты()
	
	ГраницаЧтенияЛенты = ГраницаОшибкиЧтенияЛенты;
	ИдентификаторСобытияОшибкиЛенты = "";
	ГраницаОшибкиЧтенияЛенты = "";
	
	МодульОбъекта().ГраницаЧтенияЛенты_Записать(Ссылка, ГраницаЧтенияЛенты);
	МодульОбъекта().ИдентификаторСобытияОшибкиЛенты_Записать(Ссылка, ИдентификаторСобытияОшибкиЛенты);
	МодульОбъекта().ГраницаОшибкиЧтенияЛенты_Записать(Ссылка, ГраницаОшибкиЧтенияЛенты);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыОрганизации()
	
	Наименование = СокрЛП(Организация1С);
	
	ПутьКРеквизитам = "Справочники." + Организация1С.Метаданные().Имя + ".Реквизиты";
	
	Если МодульОбъекта().ЕстьНеобходимыеМетаданные(ПутьКРеквизитам + ".ИНН") Тогда
		ИНН = СокрЛП(МодульОбъекта().ЗначениеРеквизитаОбъектаЛок(Организация1С, "ИНН"));
	КонецЕсли;
	
	Если МодульОбъекта().ЕстьНеобходимыеМетаданные(ПутьКРеквизитам + ".КПП") Тогда
		КПП = СокрЛП(МодульОбъекта().ЗначениеРеквизитаОбъектаЛок(Организация1С, "КПП"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОтображениеСрокаТарифа()
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Элементы.ГруппаИнформацияОТарифе.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	МодульОбъекта().НастроитьОтображениеСрокаТарифа(ЭтаФорма, Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюОТарифах()
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбъекта().ОбновитьИнформациюОТарифах(Ссылка);
	НастроитьОтображениеСрокаТарифа();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьУведомлениеЗаполнитеАнкету()
	
	Если Не МодульОбъекта().НужноЗаполнитьАнкету(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ТипыУведомлений = МодульОбъекта().Перечисление_ТипыУведомлений();
	ОформлениеУведомлений = МодульОбъекта().ОформлениеУведомлений();
	Оформление = ОформлениеУведомлений[ТипыУведомлений.ЗаполнитеАнкету];
	
	Элемент = Элементы.СсылкаНастройкиОрганизации;
	ЗаполнитьЗначенияСвойств(Элемент, Оформление);
	
КонецПроцедуры

&НаСервере
Функция ОписаниеОрганизацииПоКонтекстуФормы()
	
	Результат = МодульОбъекта().Новый_Организация();
	
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
	ЗаполнитьЗначенияСвойств(Результат.ДопРеквизиты, ЭтаФорма);
	
	Результат.ДопРеквизиты.ОтключитьЧтениеВходящихУПД = Не РазрешитьЧтениеВходящихУПД;
	Результат.ДопРеквизиты.ОтключитьЧтениеУведомленийОПриемке = Не РазрешитьЧтениеУведомленийОПриемке;
	Результат.ДопРеквизиты.ОтключитьОбмен = Не РазрешитьОбмен;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьВыполнениеОбменаССервисом()
	
	Если МодульКлиента().ОбменССервисомВыполняется(Ссылка) Тогда
		МодульКлиента().НастроитьКнопкуОбменаССервисом(Элементы.Кнопка_ВыполнитьОбмен, Истина);
		ПодключитьОбработчикОжидания("ОбновитьСтатусОбменаССервисом", 5, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусОбменаССервисом() Экспорт
	
	ОбменССервисомВыполняется = МодульКлиента().ОбменССервисомВыполняется(Ссылка);
	
	МодульКлиента().НастроитьКнопкуОбменаССервисом(Элементы.Кнопка_ВыполнитьОбмен, ОбменССервисомВыполняется);
	
	Если ОбменССервисомВыполняется Тогда
		ПодключитьОбработчикОжидания("ОбновитьСтатусОбменаССервисом", 5, Истина);
	Иначе
		ОбновитьФорму();
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти
